W6D3/my_project_name/app/controllers/artworks_shares_controller.rb

INSERT INTO "artworks_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 1], ["created_at", "2021-08-12 18:52:22.734128"], ["updated_at", "2021-08-12 18:52:22.734128"]]
---
    def create
        artwork_share = ArtworksShare.new(artworks_share_params)
        if artwork_share.save

SELECT  "artworks_shares".* FROM "artworks_shares" WHERE "artworks_shares"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artworks_shares" WHERE "artworks_shares"."id" = $1  [["id", 5]]
---
    def destroy
        @artwork_share = ArtworksShare.find_by(id: params[:id])
        @artwork_share.destroy