W6D3/my_project_name/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks"
---
    def index
        # @artworks = Artwork.all
        # render json: @artworks
        if params[:artwor][:id]
            a = Artwork.find_by(id: params[:id])
            u = a.artist
            s = a.shared_viewers
            render json: [u, s]
        else
           @artworks = Artwork.all