W6D3/my_project_name/app/controllers/users_controller.rb

    def index
        # render plain: "I'm in the index action!"
        @users = User.all
---
SELECT "users".* FROM "users"

    def update
        # render json: params
        @user = User.find_by(id: params[:id])
        @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Darrick"], ["email", "darrick@darrick.com"], ["updated_at", "2021-08-11 23:32:47.884585"], ["id", 1]]

    def destroy
        @user = User.find_by(id: params[:id])
        @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]