W6D3:4/my_project_name/app/controllers/comments_controller.rb

    def index
        if params[:user_id]
            user = User.find_by(id: params[:user_id])
            render json: user.comments
        elsif params[:artwork_id]
            artwork = Artwork.find(id: params[:artwork_id])
            render json: artwork.comments
        else
            @comments = Comment.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"