W6D5/99_cats/ninetyninecats/app/controllers/cats_controller.rb

    def create
        @cat = Cat.new(cat_params)

        if @cat.save
---
INSERT INTO "cats" ("birth_date", "created_at", "updated_at", "color", "name", "sex", "description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"